In [4]:
import pandas as pd
import numpy as np

In [5]:
newDf = pd.read_excel("test.xlsx")

In [6]:
newDf

  Unnamed: 0   Maas  Yas Departman
0        Can  100.0   45   Yazılım
1       Kaya  200.0   32     Hukuk
2    İbrahim    NaN   36   Yazılım
3       Mert  250.0   47       NaN
4     Mehmet  500.0   23        IK

In [7]:
newDf.dropna()

  Unnamed: 0   Maas  Yas Departman
0        Can  100.0   45   Yazılım
1       Kaya  200.0   32     Hukuk
4     Mehmet  500.0   23        IK

In [8]:
yeniTable = newDf.dropna()

In [9]:
yeniTable

  Unnamed: 0   Maas  Yas Departman
0        Can  100.0   45   Yazılım
1       Kaya  200.0   32     Hukuk
4     Mehmet  500.0   23        IK

In [10]:
yeniTable.to_excel("yeniMaas.xlsx")

In [11]:
# read_csv
# to_csv